from time import sleep
from win32api import keybd_event


def baf(k=0):
    """
    Функция использования бафов/скиллов,
    которые в зависимости от длительности
    действия, вызываются в разное время
    1 - крит
    2 - тп
    3 - ттм хп          ярость + концу
    4 - иск             закалка + бд
    5 - баф 30
    6 баф 60
    7 -
    8 - хилл (q)
    1 - 8: 70-77
    31 - 38
    70 - f1
    71 2 72 3 73 - 4 74 - 5
    full_baf - активируется при запуске бота (8)
    """
# -----------------TANK-------------------------
# закалка 180 сек \ ярость 90 \ конц 60 \ бд 300 \ морф 3600
    sleep(90)  # 90
    keybd_event(0x72, 0, 0, 0)  # makros
    # print(k)
    # sleep(1)
    # keybd_event(0x73, 0, 0, 0)
    # print('яр конц зак хлеб')
    if k % 35 == 0:
        sleep(.5)
        keybd_event(0x75, 0, 0, 0)
        # print('(баф 60)')
    elif k % 3 == 0:
        sleep(.5)
        # print('bd хлеб')
        keybd_event(0x74, 0, 0, 0)  # BD
# -----------------end TANK-------------------------


# -----------------SUM-------------------------
#     while True:
#         sleep(1)  # 120
#         k += 1
#         keybd_event(0x33, 0, 0, 0)
#         # print(k)
#         # print('ттм ',)
#         if k % 29 == 0:
#             sleep(.3)
#             keybd_event(0x36, 0, 0, 0)
#             # print('(баф 60)')
#         elif k % 15 == 0:
#             sleep(.4)
#             keybd_event(0x35, 0, 0, 0)
#             # print('(баф 30)+иск')
#         elif k % 3 == 0:
#             sleep(.3)
#             keybd_event(0x34, 0, 0, 0)
#  print('иск ')
# -----------------end SUM-------------------------


# baf()
